qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/clocks.h
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_I2C1
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_BITS   _u(0x00000080)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_MSB    _u(7)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_LSB    _u(7)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_I2C0
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_BITS   _u(0x00000040)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_MSB    _u(6)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_LSB    _u(6)
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_DMA
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_BITS   _u(0x00000020)
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_MSB    _u(5)
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_LSB    _u(5)
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_BITS   _u(0x00000010)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_MSB    _u(4)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_LSB    _u(4)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_BITS   _u(0x00000008)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_MSB    _u(3)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_LSB    _u(3)
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_ADC
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_BITS   _u(0x00000004)
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_MSB    _u(2)
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_LSB    _u(2)
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_ADC_ADC
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_ADC_ADC_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_ADC_ADC_BITS   _u(0x00000002)
#define CLOCKS_SLEEP_EN0_CLK_ADC_ADC_MSB    _u(1)
#define CLOCKS_SLEEP_EN0_CLK_ADC_ADC_LSB    _u(1)
#define CLOCKS_SLEEP_EN0_CLK_ADC_ADC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS
// Description : None
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_BITS   _u(0x00000001)
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_MSB    _u(0)
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_LSB    _u(0)
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_SLEEP_EN1
// Description : enable clock in sleep mode
#define CLOCKS_SLEEP_EN1_OFFSET _u(0x000000ac)
#define CLOCKS_SLEEP_EN1_BITS   _u(0x00007fff)
#define CLOCKS_SLEEP_EN1_RESET  _u(0x00007fff)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_XOSC
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_BITS   _u(0x00004000)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_MSB    _u(14)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_LSB    _u(14)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_XIP
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_BITS   _u(0x00002000)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_MSB    _u(13)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_LSB    _u(13)
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_BITS   _u(0x00001000)
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_MSB    _u(12)
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_LSB    _u(12)
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_USB_USBCTRL
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_USB_USBCTRL_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_USB_USBCTRL_BITS   _u(0x00000800)
#define CLOCKS_SLEEP_EN1_CLK_USB_USBCTRL_MSB    _u(11)
#define CLOCKS_SLEEP_EN1_CLK_USB_USBCTRL_LSB    _u(11)
#define CLOCKS_SLEEP_EN1_CLK_USB_USBCTRL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_BITS   _u(0x00000400)
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_MSB    _u(10)
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_LSB    _u(10)
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_UART1
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_BITS   _u(0x00000200)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_MSB    _u(9)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_LSB    _u(9)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_PERI_UART1
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_BITS   _u(0x00000100)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_MSB    _u(8)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_LSB    _u(8)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_UART0
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_BITS   _u(0x00000080)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_MSB    _u(7)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_LSB    _u(7)
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_PERI_UART0
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_BITS   _u(0x00000040)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_MSB    _u(6)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_LSB    _u(6)
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TIMER
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER_BITS   _u(0x00000020)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER_MSB    _u(5)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER_LSB    _u(5)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_BITS   _u(0x00000010)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_MSB    _u(4)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_LSB    _u(4)
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_BITS   _u(0x00000008)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_MSB    _u(3)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_LSB    _u(3)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_BITS   _u(0x00000004)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_MSB    _u(2)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_LSB    _u(2)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_BITS   _u(0x00000002)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_MSB    _u(1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_LSB    _u(1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4
// Description : None
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_RESET  _u(0x1)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_BITS   _u(0x00000001)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_MSB    _u(0)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_LSB    _u(0)
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_ENABLED0
// Description : indicates the state of the clock enable
#define CLOCKS_ENABLED0_OFFSET _u(0x000000b0)
#define CLOCKS_ENABLED0_BITS   _u(0xffffffff)
#define CLOCKS_ENABLED0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SRAM3
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SRAM3_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM3_BITS   _u(0x80000000)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM3_MSB    _u(31)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM3_LSB    _u(31)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SRAM2
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SRAM2_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM2_BITS   _u(0x40000000)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM2_MSB    _u(30)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM2_LSB    _u(30)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SRAM1
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SRAM1_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM1_BITS   _u(0x20000000)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM1_MSB    _u(29)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM1_LSB    _u(29)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SRAM0
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SRAM0_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM0_BITS   _u(0x10000000)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM0_MSB    _u(28)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM0_LSB    _u(28)
#define CLOCKS_ENABLED0_CLK_SYS_SRAM0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SPI1
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SPI1_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SPI1_BITS   _u(0x08000000)
#define CLOCKS_ENABLED0_CLK_SYS_SPI1_MSB    _u(27)
#define CLOCKS_ENABLED0_CLK_SYS_SPI1_LSB    _u(27)
#define CLOCKS_ENABLED0_CLK_SYS_SPI1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_PERI_SPI1
// Description : None
#define CLOCKS_ENABLED0_CLK_PERI_SPI1_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_PERI_SPI1_BITS   _u(0x04000000)
#define CLOCKS_ENABLED0_CLK_PERI_SPI1_MSB    _u(26)
#define CLOCKS_ENABLED0_CLK_PERI_SPI1_LSB    _u(26)
#define CLOCKS_ENABLED0_CLK_PERI_SPI1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SPI0
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SPI0_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SPI0_BITS   _u(0x02000000)
#define CLOCKS_ENABLED0_CLK_SYS_SPI0_MSB    _u(25)
#define CLOCKS_ENABLED0_CLK_SYS_SPI0_LSB    _u(25)
#define CLOCKS_ENABLED0_CLK_SYS_SPI0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_PERI_SPI0
// Description : None
#define CLOCKS_ENABLED0_CLK_PERI_SPI0_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_PERI_SPI0_BITS   _u(0x01000000)
#define CLOCKS_ENABLED0_CLK_PERI_SPI0_MSB    _u(24)
#define CLOCKS_ENABLED0_CLK_PERI_SPI0_LSB    _u(24)
#define CLOCKS_ENABLED0_CLK_PERI_SPI0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_SIO
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_SIO_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_SIO_BITS   _u(0x00800000)
#define CLOCKS_ENABLED0_CLK_SYS_SIO_MSB    _u(23)
#define CLOCKS_ENABLED0_CLK_SYS_SIO_LSB    _u(23)
#define CLOCKS_ENABLED0_CLK_SYS_SIO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_RTC
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_RTC_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_RTC_BITS   _u(0x00400000)
#define CLOCKS_ENABLED0_CLK_SYS_RTC_MSB    _u(22)
#define CLOCKS_ENABLED0_CLK_SYS_RTC_LSB    _u(22)
#define CLOCKS_ENABLED0_CLK_SYS_RTC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_RTC_RTC
// Description : None
#define CLOCKS_ENABLED0_CLK_RTC_RTC_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_RTC_RTC_BITS   _u(0x00200000)
#define CLOCKS_ENABLED0_CLK_RTC_RTC_MSB    _u(21)
#define CLOCKS_ENABLED0_CLK_RTC_RTC_LSB    _u(21)
#define CLOCKS_ENABLED0_CLK_RTC_RTC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_ROSC
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_BITS   _u(0x00100000)
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_MSB    _u(20)
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_LSB    _u(20)
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_ROM
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_ROM_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_ROM_BITS   _u(0x00080000)
#define CLOCKS_ENABLED0_CLK_SYS_ROM_MSB    _u(19)
#define CLOCKS_ENABLED0_CLK_SYS_ROM_LSB    _u(19)
#define CLOCKS_ENABLED0_CLK_SYS_ROM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_RESETS
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_BITS   _u(0x00040000)
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_MSB    _u(18)
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_LSB    _u(18)
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PWM
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PWM_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PWM_BITS   _u(0x00020000)
#define CLOCKS_ENABLED0_CLK_SYS_PWM_MSB    _u(17)
#define CLOCKS_ENABLED0_CLK_SYS_PWM_LSB    _u(17)
#define CLOCKS_ENABLED0_CLK_SYS_PWM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PSM
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PSM_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PSM_BITS   _u(0x00010000)
#define CLOCKS_ENABLED0_CLK_SYS_PSM_MSB    _u(16)
#define CLOCKS_ENABLED0_CLK_SYS_PSM_LSB    _u(16)
#define CLOCKS_ENABLED0_CLK_SYS_PSM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PLL_USB
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_BITS   _u(0x00008000)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_MSB    _u(15)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_LSB    _u(15)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PLL_SYS
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_BITS   _u(0x00004000)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_MSB    _u(14)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_LSB    _u(14)
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PIO1
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_BITS   _u(0x00002000)
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_MSB    _u(13)
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_LSB    _u(13)
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PIO0
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_BITS   _u(0x00001000)
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_MSB    _u(12)
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_LSB    _u(12)
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_PADS
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_PADS_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_PADS_BITS   _u(0x00000800)
#define CLOCKS_ENABLED0_CLK_SYS_PADS_MSB    _u(11)
#define CLOCKS_ENABLED0_CLK_SYS_PADS_LSB    _u(11)
#define CLOCKS_ENABLED0_CLK_SYS_PADS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_VREG_AND_CHIP_RESET
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_VREG_AND_CHIP_RESET_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_VREG_AND_CHIP_RESET_BITS   _u(0x00000400)
#define CLOCKS_ENABLED0_CLK_SYS_VREG_AND_CHIP_RESET_MSB    _u(10)
#define CLOCKS_ENABLED0_CLK_SYS_VREG_AND_CHIP_RESET_LSB    _u(10)
#define CLOCKS_ENABLED0_CLK_SYS_VREG_AND_CHIP_RESET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_JTAG
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_BITS   _u(0x00000200)
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_MSB    _u(9)
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_LSB    _u(9)
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_IO
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_IO_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_IO_BITS   _u(0x00000100)
#define CLOCKS_ENABLED0_CLK_SYS_IO_MSB    _u(8)
#define CLOCKS_ENABLED0_CLK_SYS_IO_LSB    _u(8)
#define CLOCKS_ENABLED0_CLK_SYS_IO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_I2C1
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_BITS   _u(0x00000080)
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_MSB    _u(7)
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_LSB    _u(7)
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_I2C0
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_BITS   _u(0x00000040)
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_MSB    _u(6)
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_LSB    _u(6)
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_DMA
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_DMA_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_DMA_BITS   _u(0x00000020)
#define CLOCKS_ENABLED0_CLK_SYS_DMA_MSB    _u(5)
#define CLOCKS_ENABLED0_CLK_SYS_DMA_LSB    _u(5)
#define CLOCKS_ENABLED0_CLK_SYS_DMA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_BITS   _u(0x00000010)
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_MSB    _u(4)
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_LSB    _u(4)
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_BUSCTRL
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_BITS   _u(0x00000008)
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_MSB    _u(3)
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_LSB    _u(3)
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_ADC
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_ADC_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_ADC_BITS   _u(0x00000004)
#define CLOCKS_ENABLED0_CLK_SYS_ADC_MSB    _u(2)
#define CLOCKS_ENABLED0_CLK_SYS_ADC_LSB    _u(2)
#define CLOCKS_ENABLED0_CLK_SYS_ADC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_ADC_ADC
// Description : None
#define CLOCKS_ENABLED0_CLK_ADC_ADC_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_ADC_ADC_BITS   _u(0x00000002)
#define CLOCKS_ENABLED0_CLK_ADC_ADC_MSB    _u(1)
#define CLOCKS_ENABLED0_CLK_ADC_ADC_LSB    _u(1)
#define CLOCKS_ENABLED0_CLK_ADC_ADC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED0_CLK_SYS_CLOCKS
// Description : None
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_RESET  _u(0x0)
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_BITS   _u(0x00000001)
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_MSB    _u(0)
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_LSB    _u(0)
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_ENABLED1
// Description : indicates the state of the clock enable
#define CLOCKS_ENABLED1_OFFSET _u(0x000000b4)
#define CLOCKS_ENABLED1_BITS   _u(0x00007fff)
#define CLOCKS_ENABLED1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
