qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/clocks.h
// Field       : CLOCKS_ENABLED1_CLK_SYS_XOSC
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_BITS   _u(0x00004000)
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_MSB    _u(14)
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_LSB    _u(14)
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_XIP
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_XIP_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_XIP_BITS   _u(0x00002000)
#define CLOCKS_ENABLED1_CLK_SYS_XIP_MSB    _u(13)
#define CLOCKS_ENABLED1_CLK_SYS_XIP_LSB    _u(13)
#define CLOCKS_ENABLED1_CLK_SYS_XIP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_WATCHDOG
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_BITS   _u(0x00001000)
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_MSB    _u(12)
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_LSB    _u(12)
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_USB_USBCTRL
// Description : None
#define CLOCKS_ENABLED1_CLK_USB_USBCTRL_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_USB_USBCTRL_BITS   _u(0x00000800)
#define CLOCKS_ENABLED1_CLK_USB_USBCTRL_MSB    _u(11)
#define CLOCKS_ENABLED1_CLK_USB_USBCTRL_LSB    _u(11)
#define CLOCKS_ENABLED1_CLK_USB_USBCTRL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_USBCTRL
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_BITS   _u(0x00000400)
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_MSB    _u(10)
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_LSB    _u(10)
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_UART1
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_UART1_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_UART1_BITS   _u(0x00000200)
#define CLOCKS_ENABLED1_CLK_SYS_UART1_MSB    _u(9)
#define CLOCKS_ENABLED1_CLK_SYS_UART1_LSB    _u(9)
#define CLOCKS_ENABLED1_CLK_SYS_UART1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_PERI_UART1
// Description : None
#define CLOCKS_ENABLED1_CLK_PERI_UART1_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_PERI_UART1_BITS   _u(0x00000100)
#define CLOCKS_ENABLED1_CLK_PERI_UART1_MSB    _u(8)
#define CLOCKS_ENABLED1_CLK_PERI_UART1_LSB    _u(8)
#define CLOCKS_ENABLED1_CLK_PERI_UART1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_UART0
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_UART0_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_UART0_BITS   _u(0x00000080)
#define CLOCKS_ENABLED1_CLK_SYS_UART0_MSB    _u(7)
#define CLOCKS_ENABLED1_CLK_SYS_UART0_LSB    _u(7)
#define CLOCKS_ENABLED1_CLK_SYS_UART0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_PERI_UART0
// Description : None
#define CLOCKS_ENABLED1_CLK_PERI_UART0_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_PERI_UART0_BITS   _u(0x00000040)
#define CLOCKS_ENABLED1_CLK_PERI_UART0_MSB    _u(6)
#define CLOCKS_ENABLED1_CLK_PERI_UART0_LSB    _u(6)
#define CLOCKS_ENABLED1_CLK_PERI_UART0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_TIMER
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_TIMER_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_TIMER_BITS   _u(0x00000020)
#define CLOCKS_ENABLED1_CLK_SYS_TIMER_MSB    _u(5)
#define CLOCKS_ENABLED1_CLK_SYS_TIMER_LSB    _u(5)
#define CLOCKS_ENABLED1_CLK_SYS_TIMER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_TBMAN
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_BITS   _u(0x00000010)
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_MSB    _u(4)
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_LSB    _u(4)
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SYSINFO
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_BITS   _u(0x00000008)
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_MSB    _u(3)
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_LSB    _u(3)
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SYSCFG
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_BITS   _u(0x00000004)
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_MSB    _u(2)
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_LSB    _u(2)
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM5
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_BITS   _u(0x00000002)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_MSB    _u(1)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_LSB    _u(1)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM4
// Description : None
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_BITS   _u(0x00000001)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_MSB    _u(0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_LSB    _u(0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_INTR
// Description : Raw Interrupts
#define CLOCKS_INTR_OFFSET _u(0x000000b8)
#define CLOCKS_INTR_BITS   _u(0x00000001)
#define CLOCKS_INTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTR_CLK_SYS_RESUS
// Description : None
#define CLOCKS_INTR_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTR_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTR_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTR_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTR_CLK_SYS_RESUS_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_INTE
// Description : Interrupt Enable
#define CLOCKS_INTE_OFFSET _u(0x000000bc)
#define CLOCKS_INTE_BITS   _u(0x00000001)
#define CLOCKS_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTE_CLK_SYS_RESUS
// Description : None
#define CLOCKS_INTE_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTE_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTE_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTE_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTE_CLK_SYS_RESUS_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_INTF
// Description : Interrupt Force
#define CLOCKS_INTF_OFFSET _u(0x000000c0)
#define CLOCKS_INTF_BITS   _u(0x00000001)
#define CLOCKS_INTF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTF_CLK_SYS_RESUS
// Description : None
#define CLOCKS_INTF_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTF_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTF_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTF_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTF_CLK_SYS_RESUS_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_INTS
// Description : Interrupt status after masking & forcing
#define CLOCKS_INTS_OFFSET _u(0x000000c4)
#define CLOCKS_INTS_BITS   _u(0x00000001)
#define CLOCKS_INTS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTS_CLK_SYS_RESUS
// Description : None
#define CLOCKS_INTS_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTS_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTS_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTS_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTS_CLK_SYS_RESUS_ACCESS "RO"
// =============================================================================
#endif // HARDWARE_REGS_CLOCKS_DEFINED
